{
  "totalBooks": 66,
  "completedBooks": 0,
  "currentBook": "Genesis",
  "completedChapters": 7,
  "totalChapters": 1189,
  "books": {
    "gen": {
      "chapters": {
        "1": {
          "completed": true,
          "verseCount": 31,
          "text": "1 In the beginning God created the heavens and the earth. 2 The earth was formless and void, and darkness was over the surface of the deep, and the Spirit of God was moving over the surface of the waters. 3 Then God said, “Let there be light”; and there was light. 4 God saw that the light was good; and God separated the light from the darkness. 5 God called the light day, and the darkness He called night. And there was evening and there was morning, one day.\n\n6 Then God said, “Let there be an expanse in the midst of the waters, and let it separate the waters from the waters.” 7 God made the expanse, and separated the waters which were below the expanse from the waters which were above the expanse; and it was so. 8 God called the expanse heaven. And there was evening and there was morning, a second day.\n\n9 Then God said, “Let the waters below the heavens be gathered into one place, and let the dry land appear”; and it was so. 10 God called the dry land earth, and the gathering of the waters He called seas; and God saw that it was good. 11 Then God said, “Let the earth sprout vegetation, plants yielding seed, and fruit trees on the earth bearing fruit after their kind with seed in them”; and it was so. 12 The earth brought forth vegetation, plants yielding seed after their kind, and trees bearing fruit with seed in them, after their kind; and God saw that it was good. 13 There was evening and there was morning, a third day.\n\n14 Then God said, “Let there be lights in the expanse of the heavens to separate the day from the night, and let them be for signs and for seasons and for days and years; 15 and let them be for lights in the expanse of the heavens to give light on the earth”; and it was so. 16 God made the two great lights, the greater light to govern the day, and the lesser light to govern the night; He made the stars also. 17 God placed them in the expanse of the heavens to give light on the earth, 18 and to govern the day and the night, and to separate the light from the darkness; and God saw that it was good. 19 There was evening and there was morning, a fourth day.\n\n20 Then God said, “Let the waters teem with swarms of living creatures, and let birds fly above the earth in the open expanse of the heavens.” 21 God created the great sea monsters and every living creature that moves, with which the waters swarmed after their kind, and every winged bird after its kind; and God saw that it was good. 22 God blessed them, saying, “Be fruitful and multiply, and fill the waters in the seas, and let birds multiply on the earth.” 23 There was evening and there was morning, a fifth day.\n\n24 Then God said, “Let the earth bring forth living creatures after their kind: cattle and creeping things and beasts of the earth after their kind”; and it was so. 25 God made the beasts of the earth after their kind, and the cattle after their kind, and everything that creeps on the ground after its kind; and God saw that it was good.\n\n26 Then God said, “Let Us make man in Our image, according to Our likeness; and let them rule over the fish of the sea and over the birds of the sky and over the cattle and over all the earth, and over every creeping thing that creeps on the earth.” 27 God created man in His own image, in the image of God He created him; male and female He created them. 28 God blessed them; and God said to them, “Be fruitful and multiply, and fill the earth, and subdue it; and rule over the fish of the sea and over the birds of the sky and over every living thing that moves on the earth.” 29 Then God said, “Behold, I have given you every plant yielding seed that is on the surface of all the earth, and every tree which has fruit yielding seed; it shall be food for you; 30 and to every beast of the earth and to every bird of the sky and to every thing that moves on the earth which has life, I have given every green plant for food”; and it was so. 31 God saw all that He had made, and behold, it was very good. And there was evening and there was morning, the sixth day."
        },
        "2": {
          "completed": true,
          "verseCount": 25,
          "text": "1 Thus the heavens and the earth were completed, and all their hosts. 2 By the seventh day God completed His work which He had done, and He rested on the seventh day from all His work which He had done. 3 Then God blessed the seventh day and sanctified it, because in it He rested from all His work which God had created and made.\n\n4 This is the account of the heavens and the earth when they were created, in the day that the Lord God made earth and heaven. 5 Now no shrub of the field was yet in the earth, and no plant of the field had yet sprouted, for the Lord God had not sent rain upon the earth, and there was no man to cultivate the ground. 6 But a mist used to rise from the earth and water the whole surface of the ground. 7 Then the Lord God formed man of dust from the ground, and breathed into his nostrils the breath of life; and man became a living being. 8 The Lord God planted a garden toward the east, in Eden; and there He placed the man whom He had formed. 9 Out of the ground the Lord God caused to grow every tree that is pleasing to the sight and good for food; the tree of life also in the midst of the garden, and the tree of the knowledge of good and evil.\n\n10 Now a river flowed out of Eden to water the garden; and from there it divided and became four rivers. 11 The name of the first is Pishon; it flows around the whole land of Havilah, where there is gold. 12 The gold of that land is good; the bdellium and the onyx stone are there. 13 The name of the second river is Gihon; it flows around the whole land of Cush. 14 The name of the third river is Tigris; it flows east of Assyria. And the fourth river is the Euphrates.\n\n15 Then the Lord God took the man and put him into the garden of Eden to cultivate it and keep it. 16 The Lord God commanded the man, saying, “From any tree of the garden you may eat freely; 17 but from the tree of the knowledge of good and evil you shall not eat, for in the day that you eat from it you will surely die.”\n\n18 Then the Lord God said, “It is not good for the man to be alone; I will make him a helper suitable for him.” 19 Out of the ground the Lord God formed every beast of the field and every bird of the sky, and brought them to the man to see what he would call them; and whatever the man called a living creature, that was its name. 20 The man gave names to all the cattle, and to the birds of the sky, and to every beast of the field, but for Adam there was not found a helper suitable for him. 21 So the Lord God caused a deep sleep to fall upon the man, and he slept; then He took one of his ribs and closed up the flesh at that place. 22 The Lord God fashioned into a woman the rib which He had taken from the man, and brought her to the man. 23 The man said,\n\n“This is now bone of my bones,\nAnd flesh of my flesh;\nShe shall be called Woman,\nBecause she was taken out of Man.”\n\n24 For this reason a man shall leave his father and his mother, and be joined to his wife; and they shall become one flesh. 25 And the man and his wife were both naked and were not ashamed."
        },
        "3": {
          "completed": true,
          "verseCount": 24,
          "text": "3 Now the serpent was more crafty than any beast of the field which the Lord God had made. And he said to the woman, “Indeed, has God said, ‘You shall not eat from any tree of the garden’?” 2 The woman said to the serpent, “From the fruit of the trees of the garden we may eat; 3 but from the fruit of the tree which is in the middle of the garden, God has said, ‘You shall not eat from it or touch it, or you will die.’” 4 The serpent said to the woman, “You surely will not die! 5 For God knows that in the day you eat from it your eyes will be opened, and you will be like God, knowing good and evil.” 6 When the woman saw that the tree was good for food, and that it was a delight to the eyes, and that the tree was desirable to make one wise, she took from its fruit and ate; and she gave also to her husband with her, and he ate. 7 Then the eyes of both of them were opened, and they knew that they were naked; and they sewed fig leaves together and made themselves loin coverings.\n\n8 They heard the sound of the Lord God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the Lord God among the trees of the garden. 9 Then the Lord God called to the man, and said to him, “Where are you?” 10 He said, “I heard the sound of You in the garden, and I was afraid because I was naked; so I hid myself.” 11 And He said, “Who told you that you were naked? Have you eaten from the tree of which I commanded you not to eat?” 12 The man said, “The woman whom You gave to be with me, she gave me from the tree, and I ate.” 13 Then the Lord God said to the woman, “What is this you have done?” And the woman said, “The serpent deceived me, and I ate.” 14 The Lord God said to the serpent,\n\n“Because you have done this,\nCursed are you more than all cattle,\nAnd more than every beast of the field;\nOn your belly you will go,\nAnd dust you will eat\nAll the days of your life;\n15 And I will put enmity\nBetween you and the woman,\nAnd between your seed and her seed;\nHe shall bruise you on the head,\nAnd you shall bruise him on the heel.”\n16 To the woman He said,\n“I will greatly multiply\nYour pain in childbirth,\nIn pain you will bring forth children;\nYet your desire will be for your husband,\nAnd he will rule over you.”\n\n17 Then to Adam He said, “Because you have listened to the voice of your wife, and have eaten from the tree about which I commanded you, saying, ‘You shall not eat from it’;\n\nCursed is the ground because of you;\nIn toil you will eat of it\nAll the days of your life.\n18 “Both thorns and thistles it shall grow for you;\nAnd you will eat the plants of the field;\n19 By the sweat of your face\nYou will eat bread,\nTill you return to the ground,\nBecause from it you were taken;\nFor you are dust,\nAnd to dust you shall return.”\n\n20 Now the man called his wife’s name Eve, because she was the mother of all the living. 21 The Lord God made garments of skin for Adam and his wife, and clothed them.\n\n22 Then the Lord God said, “Behold, the man has become like one of Us, knowing good and evil; and now, he might stretch out his hand, and take also from the tree of life, and eat, and live forever”— 23 therefore the Lord God sent him out from the garden of Eden, to cultivate the ground from which he was taken. 24 So He drove the man out; and at the east of the garden of Eden He stationed the cherubim and the flaming sword which turned every direction to guard the way to the tree of life."
        },
        "5": {
          "completed": true,
          "verseCount": 32,
          "text": "1 This is the book of the generations of Adam. In the day when God created man, He made him in the likeness of God. 2 He created them male and female, and He blessed them and named them Man in the day when they were created.\n\n3 When Adam had lived one hundred and thirty years, he became the father of a son in his own likeness, according to his image, and named him Seth. 4 Then the days of Adam after he became the father of Seth were eight hundred years, and he had other sons and daughters. 5 So all the days that Adam lived were nine hundred and thirty years, and he died.\n\n6 Seth lived one hundred and five years, and became the father of Enosh. 7 Then Seth lived eight hundred and seven years after he became the father of Enosh, and he had other sons and daughters. 8 So all the days of Seth were nine hundred and twelve years, and he died.\n\n9 Enosh lived ninety years, and became the father of Kenan. 10 Then Enosh lived eight hundred and fifteen years after he became the father of Kenan, and he had other sons and daughters. 11 So all the days of Enosh were nine hundred and five years, and he died.\n\n12 Kenan lived seventy years, and became the father of Mahalalel. 13 Then Kenan lived eight hundred and forty years after he became the father of Mahalalel, and he had other sons and daughters. 14 So all the days of Kenan were nine hundred and ten years, and he died.\n\n15 Mahalalel lived sixty-five years, and became the father of Jared. 16 Then Mahalalel lived eight hundred and thirty years after he became the father of Jared, and he had other sons and daughters. 17 So all the days of Mahalalel were eight hundred and ninety-five years, and he died.\n\n18 Jared lived one hundred and sixty-two years, and became the father of Enoch. 19 Then Jared lived eight hundred years after he became the father of Enoch, and he had other sons and daughters. 20 So all the days of Jared were nine hundred and sixty-two years, and he died.\n\n21 Enoch lived sixty-five years, and became the father of Methuselah. 22 Then Enoch walked with God three hundred years after he became the father of Methuselah, and he had other sons and daughters. 23 So all the days of Enoch were three hundred and sixty-five years. 24 Enoch walked with God; and he was not, for God took him.\n\n25 Methuselah lived one hundred and eighty-seven years, and became the father of Lamech. 26 Then Methuselah lived seven hundred and eighty-two years after he became the father of Lamech, and he had other sons and daughters. 27 So all the days of Methuselah were nine hundred and sixty-nine years, and he died.\n\n28 Lamech lived one hundred and eighty-two years, and became the father of a son. 29 Now he called his name Noah, saying, “This one will give us rest from our work and from the toil of our hands arising from the ground which the Lord has cursed.” 30 Then Lamech lived five hundred and ninety-five years after he became the father of Noah, and he had other sons and daughters. 31 So all the days of Lamech were seven hundred and seventy-seven years, and he died.\n\n32 Noah was five hundred years old, and Noah became the father of Shem, Ham, and Japheth."
        },
        "6": {
          "completed": true,
          "verseCount": 21,
          "text": "1 Now it came about, when men began to multiply on the face of the land, and daughters were born to them, 2 that the sons of God saw that the daughters of men were beautiful; and they took wives for themselves, whomever they chose. 3 Then the Lord said, “My Spirit shall not strive with man forever, because he also is flesh; nevertheless his days shall be one hundred and twenty years.” 4 The Nephilim were on the earth in those days, and also afterward, when the sons of God came in to the daughters of men, and they bore children to them. Those were the mighty men who were of old, men of renown.\n\n5 Then the Lord saw that the wickedness of man was great on the earth, and that every intent of the thoughts of his heart was only evil continually. 6 The Lord was sorry that He had made man on the earth, and He was grieved in His heart. 7 The Lord said, “I will blot out man whom I have created from the face of the land, from man to animals to creeping things and to birds of the sky; for I am sorry that I have made them.” 8 But Noah found favor in the eyes of the Lord.\n\n9 These are the records of the generations of Noah. Noah was a righteous man, blameless in his time; Noah walked with God. 10 Noah became the father of three sons: Shem, Ham, and Japheth.\n\n11 Now the earth was corrupt in the sight of God, and the earth was filled with violence. 12 God looked on the earth, and behold, it was corrupt; for all flesh had corrupted their way upon the earth.\n\n13 Then God said to Noah, “The end of all flesh has come before Me; for the earth is filled with violence because of them; and behold, I am about to destroy them with the earth. 14 Make for yourself an ark of gopher wood; you shall make the ark with rooms, and shall cover it inside and out with pitch. 15 This is how you shall make it: the length of the ark three hundred cubits, its breadth fifty cubits, and its height thirty cubits. 16 You shall make a window for the ark, and finish it to a cubit from the top; and set the door of the ark in the side of it; you shall make it with lower, second, and third decks. 17 Behold, I, even I am bringing the flood of water upon the earth, to destroy all flesh in which is the breath of life, from under heaven; everything that is on the earth shall perish. 18 But I will establish My covenant with you; and you shall enter the ark—you and your sons and your wife, and your sons’ wives with you. 19 And of every living thing of all flesh, you shall bring two of every kind into the ark, to keep them alive with you; they shall be male and female. 20 Of the birds after their kind, and of the animals after their kind, of every creeping thing of the ground after its kind, two of every kind will come to you to keep them alive. 21 As for you, take for yourself some of all food which is edible, and gather it to yourself; and it shall be for food for you and for them.” 22 Thus Noah did; according to all that God had commanded him, so he did."
        },
        "7": {
          "completed": true,
          "verseCount": 24,
          "text": "1 Then the Lord said to Noah, “Enter the ark, you and all your household, for you alone I have seen to be righteous before Me in this time. 2 You shall take with you of every clean animal by sevens, a male and his female; and of the animals that are not clean two, a male and his female; 3 also of the birds of the sky, by sevens, male and female, to keep offspring alive on the face of all the earth. 4 For after seven more days, I will send rain on the earth forty days and forty nights; and I will blot out from the face of the land every living thing that I have made.” 5 Noah did according to all that the Lord had commanded him.\n\n6 Now Noah was six hundred years old when the flood of water came upon the earth. 7 Then Noah and his sons and his wife and his sons’ wives with him entered the ark because of the water of the flood. 8 Of clean animals and animals that are not clean and birds and everything that creeps on the ground, 9 there went into the ark to Noah by twos, male and female, as God had commanded Noah. 10 It came about after the seven days, that the water of the flood came upon the earth. 11 In the six hundredth year of Noah’s life, in the second month, on the seventeenth day of the month, on the same day all the fountains of the great deep burst open, and the floodgates of the sky were opened. 12 The rain fell upon the earth for forty days and forty nights.\n\n13 On the very same day Noah and Shem and Ham and Japheth, the sons of Noah, and Noah’s wife and the three wives of his sons with them, entered the ark, 14 they and every beast after its kind, and all the cattle after their kind, and every creeping thing that creeps on the earth after its kind, and every bird after its kind, all sorts of birds. 15 So they went into the ark to Noah, by twos of all flesh in which was the breath of life. 16 Those that entered, male and female of all flesh, entered as God had commanded him; and the Lord closed it behind him.\n\n17 Then the flood came upon the earth for forty days, and the water increased and lifted up the ark, so that it rose above the earth. 18 The water prevailed and increased greatly upon the earth, and the ark floated on the surface of the water. 19 The water prevailed more and more upon the earth, so that all the high mountains everywhere under the heavens were covered. 20 The water prevailed fifteen cubits higher, and the mountains were covered. 21 All flesh that moved on the earth perished, birds and cattle and beasts and every swarming thing that swarms upon the earth, and all mankind; 22 of all that was on the dry land, all in whose nostrils was the breath of the spirit of life, died. 23 Thus He blotted out every living thing that was upon the face of the land, from man to animals to creeping things and to birds of the sky, and they were blotted out from the earth; and only Noah was left, together with those that were with him in the ark. 24 The water prevailed upon the earth one hundred and fifty days."
        },
        "8": {
          "completed": true,
          "verseCount": 31,
          "text": "1 In the beginning God created the heavens and the earth. 2 The earth was formless and void, and darkness was over the surface of the deep, and the Spirit of God was moving over the surface of the waters. 3 Then God said, “Let there be light”; and there was light. 4 God saw that the light was good; and God separated the light from the darkness. 5 God called the light day, and the darkness He called night. And there was evening and there was morning, one day.\n\n6 Then God said, “Let there be an expanse in the midst of the waters, and let it separate the waters from the waters.” 7 God made the expanse, and separated the waters which were below the expanse from the waters which were above the expanse; and it was so. 8 God called the expanse heaven. And there was evening and there was morning, a second day.\n\n9 Then God said, “Let the waters below the heavens be gathered into one place, and let the dry land appear”; and it was so. 10 God called the dry land earth, and the gathering of the waters He called seas; and God saw that it was good. 11 Then God said, “Let the earth sprout vegetation, plants yielding seed, and fruit trees on the earth bearing fruit after their kind with seed in them”; and it was so. 12 The earth brought forth vegetation, plants yielding seed after their kind, and trees bearing fruit with seed in them, after their kind; and God saw that it was good. 13 There was evening and there was morning, a third day.\n\n14 Then God said, “Let there be lights in the expanse of the heavens to separate the day from the night, and let them be for signs and for seasons and for days and years; 15 and let them be for lights in the expanse of the heavens to give light on the earth”; and it was so. 16 God made the two great lights, the greater light to govern the day, and the lesser light to govern the night; He made the stars also. 17 God placed them in the expanse of the heavens to give light on the earth, 18 and to govern the day and the night, and to separate the light from the darkness; and God saw that it was good. 19 There was evening and there was morning, a fourth day.\n\n20 Then God said, “Let the waters teem with swarms of living creatures, and let birds fly above the earth in the open expanse of the heavens.” 21 God created the great sea monsters and every living creature that moves, with which the waters swarmed after their kind, and every winged bird after its kind; and God saw that it was good. 22 God blessed them, saying, “Be fruitful and multiply, and fill the waters in the seas, and let birds multiply on the earth.” 23 There was evening and there was morning, a fifth day.\n\n24 Then God said, “Let the earth bring forth living creatures after their kind: cattle and creeping things and beasts of the earth after their kind”; and it was so. 25 God made the beasts of the earth after their kind, and the cattle after their kind, and everything that creeps on the ground after its kind; and God saw that it was good.\n\n26 Then God said, “Let Us make man in Our image, according to Our likeness; and let them rule over the fish of the sea and over the birds of the sky and over the cattle and over all the earth, and over every creeping thing that creeps on the earth.” 27 God created man in His own image, in the image of God He created him; male and female He created them. 28 God blessed them; and God said to them, “Be fruitful and multiply, and fill the earth, and subdue it; and rule over the fish of the sea and over the birds of the sky and over every living thing that moves on the earth.” 29 Then God said, “Behold, I have given you every plant yielding seed that is on the surface of all the earth, and every tree which has fruit yielding seed; it shall be food for you; 30 and to every beast of the earth and to every bird of the sky and to every thing that moves on the earth which has life, I have given every green plant for food”; and it was so. 31 God saw all that He had made, and behold, it was very good. And there was evening and there was morning, the sixth day."
        }
      }
    }
  },
  "lastUpdated": "2024-12-01T19:47:48.503Z",
  "totalVerses": 188
}